# Time Series Basics

## Importing Time Series Data from csv-Files

In [29]:
from dotenv import load_dotenv
import os

# Load environment variables from .env file
load_dotenv()

# Access the PROJECT_PATH variable
project_files = os.getenv("PROJECT_FILES_PT2")

In [30]:
import pandas as pd

In [40]:
temp = pd.read_csv(os.path.join(project_files, 'temp.csv'), parse_dates = ["datetime"], index_col= "datetime")

In [41]:
temp.head()

                       LA   NY
datetime
2013-01-01 00:00:00  11.7 -1.1
2013-01-01 01:00:00  10.7 -1.7
2013-01-01 02:00:00   9.9 -2.0
2013-01-01 03:00:00   9.3 -2.1
2013-01-01 04:00:00   8.8 -2.3

In [42]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 35064 entries, 2013-01-01 00:00:00 to 2016-12-31 23:00:00
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LA      35062 non-null  float64
 1   NY      35064 non-null  float64
dtypes: float64(2)
memory usage: 821.8 KB

In [39]:
type(temp.iloc[0, 0])

pandas._libs.tslibs.timestamps.Timestamp

In [43]:
temp.index

DatetimeIndex(['2013-01-01 00:00:00', '2013-01-01 01:00:00',
               '2013-01-01 02:00:00', '2013-01-01 03:00:00',
               '2013-01-01 04:00:00', '2013-01-01 05:00:00',
               '2013-01-01 06:00:00', '2013-01-01 07:00:00',
               '2013-01-01 08:00:00', '2013-01-01 09:00:00',
               ...
               '2016-12-31 14:00:00', '2016-12-31 15:00:00',
               '2016-12-31 16:00:00', '2016-12-31 17:00:00',
               '2016-12-31 18:00:00', '2016-12-31 19:00:00',
               '2016-12-31 20:00:00', '2016-12-31 21:00:00',
               '2016-12-31 22:00:00', '2016-12-31 23:00:00'],
              dtype='datetime64[ns]', name='datetime', length=35064, freq=None)

In [44]:
temp.index[0]

Timestamp('2013-01-01 00:00:00')

## Converting strings to datetime objects with pd.to_datetime()

In [ ]:
import pandas as pd

In [45]:
temp = pd.read_csv(os.path.join(project_files, 'temp.csv'))

In [46]:
temp.head()

              datetime    LA   NY
0  2013-01-01 00:00:00  11.7 -1.1
1  2013-01-01 01:00:00  10.7 -1.7
2  2013-01-01 02:00:00   9.9 -2.0
3  2013-01-01 03:00:00   9.3 -2.1
4  2013-01-01 04:00:00   8.8 -2.3

In [47]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35064 entries, 0 to 35063
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  35064 non-null  object
 1   LA        35062 non-null  float64
 2   NY        35064 non-null  float64
dtypes: float64(2), object(1)
memory usage: 821.9+ KB

In [48]:
temp.datetime[0]

'2013-01-01 00:00:00'

In [49]:
pd.to_datetime(temp.datetime)

0       2013-01-01 00:00:00
1       2013-01-01 01:00:00
2       2013-01-01 02:00:00
3       2013-01-01 03:00:00
4       2013-01-01 04:00:00
                ...
35059   2016-12-31 19:00:00
35060   2016-12-31 20:00:00
35061   2016-12-31 21:00:00
35062   2016-12-31 22:00:00
35063   2016-12-31 23:00:00
Name: datetime, Length: 35064, dtype: datetime64[ns]

In [50]:
# step 1 - convert datetime column to datetime format
# step 2 - set new datetime column as index
# step 3 - drop old datetime column
# step 4 - update temp variable

temp = temp.set_index(pd.to_datetime(temp.datetime)).drop("datetime", axis = 1)

In [51]:
temp.head()

                       LA   NY
datetime
2013-01-01 00:00:00  11.7 -1.1
2013-01-01 01:00:00  10.7 -1.7
2013-01-01 02:00:00   9.9 -2.0
2013-01-01 03:00:00   9.3 -2.1
2013-01-01 04:00:00   8.8 -2.3

In [52]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 35064 entries, 2013-01-01 00:00:00 to 2016-12-31 23:00:00
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LA      35062 non-null  float64
 1   NY      35064 non-null  float64
dtypes: float64(2)
memory usage: 821.8 KB

In [53]:
temp.index[0]

Timestamp('2013-01-01 00:00:00')

In [54]:
pd.to_datetime("2015-05-20 10:30:20")

Timestamp('2015-05-20 10:30:20')

In [55]:
pd.to_datetime("20150520")

Timestamp('2015-05-20 00:00:00')

In [56]:
pd.to_datetime("2015/05/20")

Timestamp('2015-05-20 00:00:00')

In [57]:
pd.to_datetime("2015 05 20")

Timestamp('2015-05-20 00:00:00')

In [58]:
#pd.to_datetime("2015-20-05")

In [59]:
pd.to_datetime("2015 May 20")

Timestamp('2015-05-20 00:00:00')

In [60]:
pd.to_datetime("May 2015 20")

Timestamp('2015-05-20 00:00:00')

In [61]:
pd.to_datetime("2015 20th may")

Timestamp('2015-05-20 00:00:00')

In [62]:
#pd.to_datetime(["2015-05-20", "Feb 20 2015"]) # old

In [65]:
pd.to_datetime(["2015-05-20", "Feb 20 2015"], format = "mixed") # new

DatetimeIndex(['2015-05-20', '2015-02-20'], dtype='datetime64[ns]', freq=None)

In [66]:
pd.to_datetime(["2015-05-20", "Feb 20 2015", "Elephant"], errors="coerce") # old

DatetimeIndex(['2015-05-20', 'NaT', 'NaT'], dtype='datetime64[ns]', freq=None)

In [67]:
pd.to_datetime(["2015-05-20", "Feb 20 2015", "Elephant"], format = "mixed", errors="coerce") # new

DatetimeIndex(['2015-05-20', '2015-02-20', 'NaT'], dtype='datetime64[ns]', freq=None)

## Indexing and Slicing Time Series

In [ ]:
import pandas as pd

In [68]:
temp = pd.read_csv(os.path.join(project_files, 'temp.csv'), parse_dates= ["datetime"], index_col= "datetime")

In [69]:
temp.head()

                       LA   NY
datetime
2013-01-01 00:00:00  11.7 -1.1
2013-01-01 01:00:00  10.7 -1.7
2013-01-01 02:00:00   9.9 -2.0
2013-01-01 03:00:00   9.3 -2.1
2013-01-01 04:00:00   8.8 -2.3

In [70]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 35064 entries, 2013-01-01 00:00:00 to 2016-12-31 23:00:00
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LA      35062 non-null  float64
 1   NY      35064 non-null  float64
dtypes: float64(2)
memory usage: 821.8 KB

In [71]:
temp.loc["2013-01-01 01:00:00"]

LA    10.7
NY    -1.7
Name: 2013-01-01 01:00:00, dtype: float64

In [72]:
temp.loc["2015"]

                       LA   NY
datetime
2015-01-01 00:00:00   3.8 -5.1
2015-01-01 01:00:00   4.4 -5.1
2015-01-01 02:00:00   3.2 -6.0
2015-01-01 03:00:00   1.2 -6.0
2015-01-01 04:00:00   0.2 -6.0
...                   ...  ...
2015-12-31 19:00:00  16.0  8.1
2015-12-31 20:00:00  16.0  8.1
2015-12-31 21:00:00  16.4  7.9
2015-12-31 22:00:00  16.6  7.2
2015-12-31 23:00:00  16.8  6.2

[8760 rows x 2 columns]

In [73]:
temp.loc["2015-05"]

                       LA    NY
datetime
2015-05-01 00:00:00  25.5  13.9
2015-05-01 01:00:00  25.7  13.9
2015-05-01 02:00:00  23.8  10.5
2015-05-01 03:00:00  22.0  10.2
2015-05-01 04:00:00  20.1   8.6
...                   ...   ...
2015-05-31 19:00:00  25.4  25.5
2015-05-31 20:00:00  26.0  23.9
2015-05-31 21:00:00  24.9  22.5
2015-05-31 22:00:00  26.0  21.3
2015-05-31 23:00:00  25.5  19.9

[744 rows x 2 columns]

In [74]:
temp.loc["2015-05-20"].shape

(24, 2)

In [75]:
temp.loc["2015-05-20 10:00:00"]

LA     7.8
NY    13.3
Name: 2015-05-20 10:00:00, dtype: float64

In [76]:
#temp.loc["2015-05-20 10:30:00"]

In [77]:
temp.loc["2015-01-01" : "2015-12-31"]

                       LA   NY
datetime
2015-01-01 00:00:00   3.8 -5.1
2015-01-01 01:00:00   4.4 -5.1
2015-01-01 02:00:00   3.2 -6.0
2015-01-01 03:00:00   1.2 -6.0
2015-01-01 04:00:00   0.2 -6.0
...                   ...  ...
2015-12-31 19:00:00  16.0  8.1
2015-12-31 20:00:00  16.0  8.1
2015-12-31 21:00:00  16.4  7.9
2015-12-31 22:00:00  16.6  7.2
2015-12-31 23:00:00  16.8  6.2

[8760 rows x 2 columns]

In [78]:
temp.loc["2015-01-01" : "2015-12-31"].equals(temp.loc["2015"])

True

In [79]:
temp.loc["2015-04-15" : "2016-02-23"]

                       LA    NY
datetime
2015-04-15 00:00:00  19.1  12.8
2015-04-15 01:00:00  20.0  12.0
2015-04-15 02:00:00  17.7  11.3
2015-04-15 03:00:00  15.5  11.2
2015-04-15 04:00:00  13.3  10.4
...                   ...   ...
2016-02-23 19:00:00  23.4   2.6
2016-02-23 20:00:00  23.4   2.2
2016-02-23 21:00:00  26.8   2.2
2016-02-23 22:00:00  26.8   2.0
2016-02-23 23:00:00  26.8   2.3

[7560 rows x 2 columns]

In [80]:
temp.loc["2015-05-20":]

                       LA    NY
datetime
2015-05-20 00:00:00  17.7  19.8
2015-05-20 01:00:00  18.0  19.7
2015-05-20 02:00:00  16.6  19.0
2015-05-20 03:00:00  14.4  19.0
2015-05-20 04:00:00  13.3  19.7
...                   ...   ...
2016-12-31 19:00:00  13.5   4.6
2016-12-31 20:00:00  13.2   5.7
2016-12-31 21:00:00  12.8   5.8
2016-12-31 22:00:00  12.3   5.7
2016-12-31 23:00:00  11.9   5.5

[14208 rows x 2 columns]

In [81]:
temp.loc[:"2015-05-20"]

                       LA    NY
datetime
2013-01-01 00:00:00  11.7  -1.1
2013-01-01 01:00:00  10.7  -1.7
2013-01-01 02:00:00   9.9  -2.0
2013-01-01 03:00:00   9.3  -2.1
2013-01-01 04:00:00   8.8  -2.3
...                   ...   ...
2015-05-20 19:00:00  17.7  18.1
2015-05-20 20:00:00  18.4  17.8
2015-05-20 21:00:00  18.0  17.8
2015-05-20 22:00:00  19.1  14.2
2015-05-20 23:00:00  19.1  14.2

[20880 rows x 2 columns]

In [82]:
temp.loc["20FEBRUARY2015"]

                       LA    NY
datetime
2015-02-20 00:00:00  16.4 -12.4
2015-02-20 01:00:00  17.5 -12.4
2015-02-20 02:00:00  14.6 -14.5
2015-02-20 03:00:00  13.9 -14.5
2015-02-20 04:00:00  10.3 -14.5
2015-02-20 05:00:00   8.9 -15.9
2015-02-20 06:00:00   9.0 -15.9
2015-02-20 07:00:00   7.1 -15.9
2015-02-20 08:00:00   6.6 -16.8
2015-02-20 09:00:00   6.3 -16.8
2015-02-20 10:00:00   5.8 -16.8
2015-02-20 11:00:00   5.5 -17.4
2015-02-20 12:00:00   5.8 -17.4
2015-02-20 13:00:00   5.2 -17.4
2015-02-20 14:00:00   5.3 -14.0
2015-02-20 15:00:00  10.5 -14.2
2015-02-20 16:00:00   8.9 -14.0
2015-02-20 17:00:00  12.4 -10.4
2015-02-20 18:00:00  12.0 -10.2
2015-02-20 19:00:00  16.8  -9.9
2015-02-20 20:00:00  17.7  -9.3
2015-02-20 21:00:00  17.2  -9.3
2015-02-20 22:00:00  18.5  -9.3
2015-02-20 23:00:00  18.5 -14.0

In [83]:
temp.loc[["2015-05-20 10:00:00", "2015-05-20 12:00:00"]] # now works

                      LA    NY
datetime
2015-05-20 10:00:00  7.8  13.3
2015-05-20 12:00:00  9.7  13.6

In [ ]:
# add series name labels

two_timestamps = pd.to_datetime(["2015-05-20 10:00:00", "2015-05-20 12:00:00"])
two_timestamps

DatetimeIndex(['2015-05-20 10:00:00', '2015-05-20 12:00:00'], dtype='datetime64[ns]', freq=None)

In [86]:
temp.loc[two_timestamps]

                      LA    NY
2015-05-20 10:00:00  7.8  13.3
2015-05-20 12:00:00  9.7  13.6

## Downsampling Time Series with resample()

In [87]:
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use("seaborn-v0_8")

In [ ]:
temp = pd.read_csv("temp.csv", parse_dates= ["datetime"], index_col = "datetime")

In [ ]:
temp.head()

In [ ]:
temp.info()

In [ ]:
temp.resample("D")

In [ ]:
list(temp.resample("D"))[1][1]

In [ ]:
temp.head(25)

In [ ]:
temp.resample("D").sum()

In [ ]:
temp.resample("2h").last() # use h instead of H

In [ ]:
temp.resample("W").mean()

In [ ]:
temp.resample("W-Wed").mean()

In [ ]:
temp.resample("ME").mean() # use ME instead of M

In [ ]:
temp.resample("MS").mean()

In [ ]:
# temp.resample("MS", loffset="14D").mean() # old

In [ ]:
# new (Alt 1)
temp.resample("MS").mean().shift(14, freq="D")

In [ ]:
# new (Alt 2)
from pandas.tseries.frequencies import to_offset
df2 = temp.resample("MS").mean()
df2.index = df2.index + to_offset("14D")
df2

In [ ]:
temp.resample("QE").mean() # use QE instead of Q

In [ ]:
temp.resample("QE-FEB").mean() # use QE-FEB instead of QE-Feb

In [ ]:
temp.resample("YE").mean() # use YE instead of A

In [ ]:
temp.resample("YS").mean() # use YS instead of AS